In [1]:
import numpy as np
import pandas as pd

In [2]:
pres = pd.read_csv("president_heights.csv")

In [3]:
pres.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [4]:
type(pres)

pandas.core.frame.DataFrame

In [5]:
# Gives you rows and columns. (rows, columns)
pres.shape

(44, 3)

In [6]:
pres.shape[0]

44

In [7]:
pres.index

RangeIndex(start=0, stop=44, step=1)

In [9]:
# column names
pres.columns

Index(['order', 'name', 'height(cm)'], dtype='object')

In [10]:
# in python object is an string
pres.dtypes

order          int64
name          object
height(cm)     int64
dtype: object

In [11]:
# returns a series
type(pres.dtypes)

pandas.core.series.Series

In [12]:
pres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       44 non-null     int64
 1   name        44 non-null     object
 2   height(cm)  44 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.2+ KB

In [16]:
# accessing a column through numpy array
pres['name'][3]

'James Madison'

In [18]:
pres[['name','height(cm)']]

                      name  height(cm)
0        George Washington         189
1               John Adams         170
2         Thomas Jefferson         189
3            James Madison         163
4             James Monroe         183
5        John Quincy Adams         171
6           Andrew Jackson         185
7         Martin Van Buren         168
8   William Henry Harrison         173
9               John Tyler         183
10           James K. Polk         173
11          Zachary Taylor         173
12        Millard Fillmore         175
13         Franklin Pierce         178
14          James Buchanan         183
15         Abraham Lincoln         193
16          Andrew Johnson         178
17        Ulysses S. Grant         173
18     Rutherford B. Hayes         174
19       James A. Garfield         183
20       Chester A. Arthur         183
21       Benjamin Harrison         168
22        William McKinley         170
23      Theodore Roosevelt         178
24     William Howard Taft         182
25          Woodrow Wilson         180
26       Warren G. Harding         183
27         Calvin Coolidge         178
28          Herbert Hoover         182
29   Franklin D. Roosevelt         188
30         Harry S. Truman         175
31    Dwight D. Eisenhower         179
32         John F. Kennedy         183
33       Lyndon B. Johnson         193
34           Richard Nixon         182
35             Gerald Ford         183
36            Jimmy Carter         177
37           Ronald Reagan         185
38       George H. W. Bush         188
39            Bill Clinton         188
40          George W. Bush         182
41            Barack Obama         185
42            Donald Trump         191
43            Joseph Biden         183

In [19]:
pres[['name','height(cm)']].head()

                name  height(cm)
0  George Washington         189
1         John Adams         170
2   Thomas Jefferson         189
3      James Madison         163
4       James Monroe         183

In [21]:
# adding a column in a dataframe
pres['height(in)'] = pres['height(cm)']/2.54

In [22]:
pres.head()

   order               name  height(cm)  height(in)
0      1  George Washington         189   74.409449
1      2         John Adams         170   66.929134
2      3   Thomas Jefferson         189   74.409449
3      4      James Madison         163   64.173228
4      5       James Monroe         183   72.047244

In [26]:
# selecting the rows that fit in certain criteria
pres[pres['height(cm)'] > 192]
# pres['height(cm)'] > 192 -> returns the booleans of every rows

    order               name  height(cm)  height(in)
15     16    Abraham Lincoln         193   75.984252
33     36  Lyndon B. Johnson         193   75.984252

In [ ]:
# drop columns or rows
# add rows
# selective of specific rows
# get more information about data frame in general